; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 35)
	(= (value c1) 65)
	(= (value c2) 49)
	(= (value c3) 29)
	(= (value c4) 74)
	(= (value c5) 82)
	(= (value c6) 29)
	(= (value c7) 27)
	(= (value c8) 15)
	(= (value c9) 69)
	(= (value c10) 70)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 5 of 10
2. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 5 of 10
3. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 5 of 10
4. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 10
5. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 5 of 10
6. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 5 of 10
7. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 10
8. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 10
9. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 10
10. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 10
11. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 10
12. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 5 of 10
13. (decrement c6)
   changed: (value c6) from 29 to 22
   goals met: 6 of 10
14. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 10
15. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 10
16. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 6 of 10
17. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 6 of 10
18. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 10
19. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 10
20. (increment c8)
   changed: (value c8) from 15 to 19
   goals met: 6 of 10
21. (increment c8)
   changed: (value c8) from 19 to 23
   goals met: 6 of 10
22. (increment c8)
   changed: (value c8) from 23 to 27
   goals met: 6 of 10
23. (increment c8)
   changed: (value c8) from 27 to 31
   goals met: 7 of 10
24. (increment c3)
   changed: (value c3) from 29 to 34
   goals met: 7 of 10
25. (increment c3)
   changed: (value c3) from 34 to 39
   goals met: 7 of 10
26. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 10
27. (increment c3)
   changed: (value c3) from 39 to 45
   goals met: 7 of 10
28. (increment c3)
   changed: (value c3) from 45 to 51
   goals met: 8 of 10
29. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 8 of 10
30. (increment c6)
   changed: (value c6) from 22 to 30
   goals met: 7 of 10
31. (increment c6)
   changed: (value c6) from 30 to 38
   goals met: 7 of 10
32. (increment c7)
   changed: (value c7) from 27 to 29
   goals met: 7 of 10
33. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 7 of 10
34. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 7 of 10
35. (increment c6)
   changed: (value c6) from 38 to 48
   goals met: 7 of 10
36. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 10
37. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 10
38. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 10
39. (increment c7)
   changed: (value c7) from 29 to 32
   goals met: 6 of 10
40. (increment c6)
   changed: (value c6) from 48 to 58
   goals met: 6 of 10
41. (increment c8)
   changed: (value c8) from 31 to 35
   goals met: 7 of 10
42. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 10
43. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 10
44. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 10
45. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 10
46. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 10
47. (increment c2)
   changed: (value c2) from 49 to 54
   goals met: 6 of 10
48. (increment c3)
   changed: (value c3) from 51 to 57
   goals met: 7 of 10
49. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 7 of 10
50. (increment c2)
   changed: (value c2) from 54 to 60
   goals met: 6 of 10
51. (increment c3)
   changed: (value c3) from 57 to 63
   goals met: 7 of 10
52. (increment c2)
   changed: (value c2) from 60 to 66
   goals met: 7 of 10
53. (increment c3)
   changed: (value c3) from 63 to 69
   goals met: 8 of 10
54. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 8 of 10
55. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 8 of 10
56. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 8 of 10
57. (increment c7)
   changed: (value c7) from 32 to 38
   goals met: 7 of 10
58. (increment c7)
   changed: (value c7) from 38 to 44
   goals met: 7 of 10
59. (increment c8)
   changed: (value c8) from 35 to 39
   goals met: 7 of 10
60. (increment c8)
   changed: (value c8) from 39 to 43
   goals met: 7 of 10
61. (increment c8)
   changed: (value c8) from 43 to 47
   goals met: 8 of 10
62. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 10
63. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 10
64. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 10
65. (decrement c5)
   changed: (value c5) from 82 to 77
   goals met: 8 of 10
66. (decrement c5)
   changed: (value c5) from 77 to 72
   goals met: 7 of 10
67. (decrement c5)
   changed: (value c5) from 72 to 67
   goals met: 7 of 10
68. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 10
69. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 10
70. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 10
71. (increment c5)
   changed: (value c5) from 67 to 75
   goals met: 8 of 10
72. (increment c7)
   changed: (value c7) from 44 to 50
   goals met: 7 of 10
73. (increment c8)
   changed: (value c8) from 47 to 51
   goals met: 8 of 10
74. (decrement c6)
   changed: (value c6) from 58 to 48
   goals met: 9 of 10
75. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 9 of 10
76. (decrement c5)
   changed: (value c5) from 75 to 66
   goals met: 8 of 10
77. (increment c6)
   changed: (value c6) from 48 to 58
   goals met: 7 of 10
78. (increment c7)
   changed: (value c7) from 50 to 56
   goals met: 6 of 10
79. (increment c8)
   changed: (value c8) from 51 to 55
   goals met: 6 of 10
80. (increment c8)
   changed: (value c8) from 55 to 59
   goals met: 7 of 10
81. (increment c7)
   changed: (value c7) from 56 to 62
   goals met: 7 of 10
82. (increment c8)
   changed: (value c8) from 59 to 63
   goals met: 8 of 10
83. (increment c5)
   changed: (value c5) from 66 to 75
   goals met: 9 of 10
84. (increment c6)
   changed: (value c6) from 58 to 68
   goals met: 8 of 10
85. (increment c7)
   changed: (value c7) from 62 to 68
   goals met: 7 of 10
86. (increment c8)
   changed: (value c8) from 63 to 67
   goals met: 7 of 10
87. (increment c8)
   changed: (value c8) from 67 to 71
   goals met: 7 of 10
88. (increment c7)
   changed: (value c7) from 68 to 74
   goals met: 7 of 10
89. (increment c8)
   changed: (value c8) from 71 to 75
   goals met: 8 of 10
90. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 10
91. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 10
92. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 8 of 10
93. (increment c9)
   changed: (value c9) from 69 to 72
   goals met: 7 of 10
94. (increment c9)
   changed: (value c9) from 72 to 75
   goals met: 7 of 10
95. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 10
96. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 10
97. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 10
98. (increment c10)
   changed: (value c10) from 70 to 73
   goals met: 7 of 10
99. (increment c10)
   changed: (value c10) from 73 to 76
   goals met: 8 of 10
100. (increment c9)
   changed: (value c9) from 75 to 78
   goals met: 8 of 10
101. (increment c10)
   changed: (value c10) from 76 to 79
   goals met: 9 of 10
102. (increment c6)
   changed: (value c6) from 68 to 78
   goals met: 9 of 10
103. (increment c7)
   changed: (value c7) from 74 to 80
   goals met: 9 of 10
104. (increment c8)
   changed: (value c8) from 75 to 79
   goals met: 8 of 10
105. (increment c9)
   changed: (value c9) from 78 to 81
   goals met: 8 of 10
106. (increment c10)
   changed: (value c10) from 79 to 82
   goals met: 9 of 10
107. (increment c8)
   changed: (value c8) from 79 to 83
   goals met: 9 of 10
108. (increment c9)
   changed: (value c9) from 81 to 84
   goals met: 9 of 10
109. (increment c10)
   changed: (value c10) from 82 to 85
   goals met: 10 of 10
